[net]
# Số lớp
num_classes = 8
# YOLOv9 configuration parameters
batch=64
subdivisions=16
width=416
height=416
channels=3
momentum=0.949
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.00261
burn_in=1000
max_batches = 500500
policy=steps
steps=400000,450000
scales=.1,.1

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# Add more convolutional layers and other types of layers as needed for your specific YOLOv9 configuration.
# The architecture usually consists of alternating convolutional and shortcut layers, followed by detection layers.

# Example convolutional layer
[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=leaky

# Example shortcut layer
[shortcut]
from=-3
activation=linear

# Example detection layer
# Replace 8 with the total number of classes
[yolo]
mask = 0,1,2
anchors = 10,13,  16,30,  33,23,  30,61,  62,45,  59,119,  116,90,  156,198,  373,326
classes=8
num=9
jitter=.3
scale_x_y = 1.05
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
ignore_thresh = .7
truth_thresh = 1
random=1
